Tekla.Structures.DetailTypeEnum
The detail type defines what kind of a detail is in question.

Tekla.Structures.DetailTypeEnum.END
With the detail type end, the X-axis is oriented towards the part's center point.

Tekla.Structures.DetailTypeEnum.INTERMEDIATE
With the detail type intermediate, the X-axis is oriented towards the end point of the part.

Tekla.Structures.DetailTypeEnum.INTERMEDIATE_REVERSE
With the detail type intermediate reverse, the X-axis is oriented towards the start point of the part.